**Empezamos los ejercicios depair programming con Pandas. En esta lecciÃ³n hemos aprendido que son las Series y DataFrames y como podemos crearlos en Python.**

In [91]:
import pandas as pd
import numpy as np

**El objetivo de la clase de hoy serÃ¡ crear unos cuÃ¡ntos dataframes y series a trvÃ©s de los siguientes ejercicios:**

**1. Â¿QuÃ© diferencia hay entre una Serie y un Dataframe?**

>**Serie**: una dimensiÃ³n, que contiene un array de datos. Tiene dos componentes principales que son los indices y vector.

>**DataFrame**: 2 dimensiones, se pueden guardar datos de distinto tipo (string, entero, float,..),la diferencia es que hay mÃ¡s dimensiones y por lo tanto podemos tener mas columnas con valores.

**2. Momento de trabajar con Series. Contestas las siguientes preguntas:**

**Crea dos listas:**

- **Una que se llame "valores" que tenga 7 nÃºmeros aleatorios.**
- **Otra que se llame "indices" que tenga 7 strings que se llamen como los dias de la semana.**

**A partir de estas dos listas crea una Serie donde la variable "valores" sean los valores de la Serie y la variable indices sean los Ã­ndices de la Serie.**

In [92]:
valores = [11,12,13,14,15,16,17]

indices = ["lunes", "martes","miercoles","jueves","viernes","sabado","domingo",]

serie1 = pd.Series(valores, index = indices)

print(serie1)

lunes        11
martes       12
miercoles    13
jueves       14
viernes      15
sabado       16
domingo      17
dtype: int64

**A partir de las dos listas anteriores crea un diccionario usando un for. Para hacer esto tenemos el mÃ©todo zip que nos permite iterar por dos listas a la vez. MÃ¡s informciÃ³n sobre este mÃ©todo aquÃ­.**

In [93]:
valores = [11,12,13,14,15,16,17]
indices = ["lunes", "martes","miercoles","jueves","viernes","sabado","domingo"]

serie2 = {}

for uno,dos in zip(indices,valores): 
    serie2 [uno] = dos

#serie2 = dict((zip(valores,indices)))  # se puede hacer asi, pero con buclo FOR arriba.
print(serie2)

{'lunes': 11, 'martes': 12, 'miercoles': 13, 'jueves': 14, 'viernes': 15, 'sabado': 16, 'domingo': 17}

**Crea una Serie con el diccionario creado en el punto anterior.**

In [94]:
serie2 

serie3 = pd.Series(serie2)
serie3

lunes        11
martes       12
miercoles    13
jueves       14
viernes      15
sabado       16
domingo      17
dtype: int64

- **Â¿QuÃ© forma tiene esta Ãºltima Serie?**
- **Â¿QuÃ© tipo de datos tiene?**
- **Â¿QuÃ© tamaÃ±o tiene?**
- **Â¿CuÃ¡les son los Ã­ndices de la Serie?**
- **Â¿Y los values?**

In [95]:
def propiedades (serie3):
    print("index:", serie3.index) 
    print("values:",serie3.values) 
    print("Forma:", serie3.shape) 
    print("NÂª elementos:", serie3.size) 
    print("Tipo de datos:", serie3.dtype) 

propiedades(serie3)

index: Index(['lunes', 'martes', 'miercoles', 'jueves', 'viernes', 'sabado',
       'domingo'],
      dtype='object')
values: [11 12 13 14 15 16 17]
Forma: (7,)
NÂª elementos: 7
Tipo de datos: int64

- **Extraed el valor para el Ã­ndice "lunes"**
- **Extraed el valor para el Ã­ndice "lunes", "martes" y "miÃ©rcoles"**
- **Extraed el valor para el Ã­ndice "lunes" y "domingo"**

In [96]:
propiedades(serie3)
print("El valor del lunes:", serie3.values[0]) 
print("El valor del lunes,martes y miercoles:",serie3.values[:3])
print("El valor de lunes a domingo:" ,serie3.values[[0,6]])

index: Index(['lunes', 'martes', 'miercoles', 'jueves', 'viernes', 'sabado',
       'domingo'],
      dtype='object')
values: [11 12 13 14 15 16 17]
Forma: (7,)
NÂª elementos: 7
Tipo de datos: int64
El valor del lunes: 11
El valor del lunes,martes y miercoles: [11 12 13]
El valor de lunes a domingo: [11 17]

**3. Es el turno de los dataframes**

- **Cread un array de dos dimensiones con 4 filas y 3 columnas.**

In [97]:
array = np.array([[1,2,3],[4,5,6],[7,8,9],[10,11,12]])
df = pd.DataFrame(array)

- **Convertid el array en un dataframe donde las columnas se llamen "EspaÃ±a", "Francia" e "Italia".**

In [98]:
df = pd.DataFrame(array, columns = ["EspaÃ±a","Francia","Italia"])
df

   EspaÃ±a  Francia  Italia
0       1        2       3
1       4        5       6
2       7        8       9
3      10       11      12


- **Descargad el archivo "medallas" y cargad el dataframe con la siguiente lÃ­ena de cÃ³digo:**

    > df = pd.read_csv("medallas.csv", index_col=["PaÃ­s"])

**ðŸ“Œ NOTA Para evitar problemas guardar el archivo medallas.csv a la misma altura que el jupyter donde estamos trabajando.**

In [99]:
df = pd.read_csv("./medallas.csv", index_col=["PaÃ­s"])
df

                 Unnamed: 0   Oro  Plata  Bronce
PaÃ­s
China                     1  1473    994     720
JapÃ³n                     2  1032   1037     985
Corea del Sur             3   745    663     827
IrÃ¡n                      4   179    181     197
KazajistÃ¡n                5   155    158     224
India                     6   154    202     315
Tailandia                 7   132    175     278
Indonesia                 8   112    131     240
China TaipÃ©i              9    99    144     276
Corea del Norte          10    91    120     235

- **Usando el loc extraed todas las columnas de la fila.**

In [100]:
df.loc["China",:]

Unnamed: 0       1
Oro           1473
Plata          994
Bronce         720
Name: China, dtype: int64

- **Usando el loc extraed todas las columnas de China e IrÃ¡n.**

In [101]:
df.loc[['China', 'IrÃ¡n'],:]

       Unnamed: 0   Oro  Plata  Bronce
PaÃ­s
China           1  1473    994     720
IrÃ¡n            4   179    181     197

- **Usando el loc extraed solo las columnas de "Oro", "Plata" y "Bronce" de China e IrÃ¡n.**

In [102]:
df.loc[['China','IrÃ¡n'],'Oro':'Bronce']

        Oro  Plata  Bronce
PaÃ­s
China  1473    994     720
IrÃ¡n    179    181     197

- **Usando el iloc extraed la informaciÃ³n de la India. Devolved todas las columnas.**

In [103]:
df.iloc[5,:]

Unnamed: 0      6
Oro           154
Plata         202
Bronce        315
Name: India, dtype: int64

- **Usando el iloc extraed todas las columnas de los paises que estÃ©n en posiciÃ³n impar. La primera que nos tendrÃ­a que salir es JapÃ³n y la Ãºltima Corea del Norte.**

In [104]:
df.iloc[1:10:2, :]

                 Unnamed: 0   Oro  Plata  Bronce
PaÃ­s
JapÃ³n                     2  1032   1037     985
IrÃ¡n                      4   179    181     197
India                     6   154    202     315
Indonesia                 8   112    131     240
Corea del Norte          10    91    120     235

- **Utilizando el cÃ³digo del ejercicio anterior, seleccionad unicamente las columnas "Oro", "Plata" y "Bronce".**

In [112]:
df.iloc[1::2,0:]

                  Oro  Plata  Bronce
PaÃ­s
JapÃ³n            1032   1037     985
IrÃ¡n              179    181     197
India             154    202     315
Indonesia         112    131     240
Corea del Norte    91    120     235

   **Contestad a las siguientes preguntas:**

- **Â¿QuÃ© paÃ­s consiguiÃ³ mÃ¡s de 200 medallas de oro?**

In [116]:
df.loc[df.Oro > 200,:]

                Oro  Plata  Bronce
PaÃ­s
China          1473    994     720
JapÃ³n          1032   1037     985
Corea del Sur   745    663     827

- **Â¿QuÃ© paÃ­s consiguiÃ³ mÃ¡s de 200 medallas de oro y mÃ¡s de 1000 de plata?**

In [107]:
df.loc[(df.Oro > 200) & (df.Plata > 1000)]

       Unnamed: 0   Oro  Plata  Bronce
PaÃ­s
JapÃ³n           2  1032   1037     985

- **Â¿QuÃ© paÃ­s consiguiÃ³ mÃ¡s de 200 medallas de oro o mÃ¡s de 700 de bronce?**

In [108]:
df.loc[(df.Oro > 200) | (df.Bronce > 700)]

               Unnamed: 0   Oro  Plata  Bronce
PaÃ­s
China                   1  1473    994     720
JapÃ³n                   2  1032   1037     985
Corea del Sur           3   745    663     827

**Como vemos hay una columna que se llama Unnamed: 0 que no nos interesa. Eliminad esa columna.**

In [ ]:
df = df.drop(["Unnamed: 0"], axis=1) # 0 es filas y 1 es columnas
#Se puede ultizar "del", para eliminar solo una columna. "drop" podemos utilizar para eliminar varias columnas a la vez.
#del df['Unnamed:0 ']

In [118]:
df

                  Oro  Plata  Bronce
PaÃ­s
China            1473    994     720
JapÃ³n            1032   1037     985
Corea del Sur     745    663     827
IrÃ¡n              179    181     197
KazajistÃ¡n        155    158     224
India             154    202     315
Tailandia         132    175     278
Indonesia         112    131     240
China TaipÃ©i       99    144     276
Corea del Norte    91    120     235

**Cread una nueva columma que se llame "total" que sea el resultado de la suma de todas las medallas obtenidas por cada paÃ­s.**

In [119]:
x = df.assign(total_medallas = df["Oro"] + df["Plata"] + df["Bronce"])
x

                  Oro  Plata  Bronce  total_medallas
PaÃ­s
China            1473    994     720            3187
JapÃ³n            1032   1037     985            3054
Corea del Sur     745    663     827            2235
IrÃ¡n              179    181     197             557
KazajistÃ¡n        155    158     224             537
India             154    202     315             671
Tailandia         132    175     278             585
Indonesia         112    131     240             483
China TaipÃ©i       99    144     276             519
Corea del Norte    91    120     235             446